---
kind: type
id: T:Autodesk.Revit.DB.SlabShapeEditor
source: html/06308ccc-46e7-6ff8-582c-6891af8b75e9.htm
---
# Autodesk.Revit.DB.SlabShapeEditor

An object used for Slab Shape Editing.

## Syntax (C#)
```csharp
public class SlabShapeEditor : IDisposable
```

## Remarks
The SlabShapeEditor can be obtained from a slab object, such as a roof or floor.